Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The following extensions are available:
ja_jp: 以下のエクステンションが利用可能です：

source: The following extensions are not yet available, but will be available soon:
ja_jp: 以下のエクステンションはまだ利用できませんが、近日中に利用可能になる予定です：

source: The following extensions can be used with Service Binding and are supported for Workload Projection:
ja_jp: Service Binding では、以下のエクステンションを使用でき、Workload Projection に対応しています。

source: The following extensions provide support for Kotlin Coroutines by allowing the use of Kotlin's `suspend` keyword on method signatures.
ja_jp: 以下のエクステンションは、Kotlinのコルーチンをサポートするために、メソッドシグネチャでKotlinの `suspend` キーワードを使用できるようにするものです。

source: The following extracts a value identified by the `keyName` field from the `my-config-map` ConfigMap into a `foo` environment variable:
ja_jp: 以下は、 `my-config-map` ConfigMap から `keyName` フィールドで識別される値を `foo` 環境変数に抽出したものです。

source: The following extracts a value identified by the `keyName` field from the `my-secret` Secret into a `foo` environment variable:
ja_jp: 以下は、 `my-secret` Secret から `keyName` フィールドで識別される値を `foo` 環境変数に抽出します。

source: The following figure depicts the architecture and how Stork locates and selects the service instance.
ja_jp: 次の図は、Storkがどのようにしてサービスインスタンスを探し出し、選択するかというアーキテクチャを示しています。

source: The following file contains all the Kubernetes resources needed to deploy the Blue and Red services in the cluster and make them accessible:
ja_jp: 以下のファイルには、Blue と Red のサービスをクラスターにデプロイし、アクセス可能にするために必要な Kubernetes リソースがすべて含まれています。

source: The following guide demonstrates how a Quarkus application can use link:https://github.com/smallrye/smallrye-metrics/[SmallRye Metrics], an implementation of the link:https://github.com/eclipse/microprofile-metrics/[MicroProfile Metrics] specification.
ja_jp: このガイドでは、Quarkusアプリケーションが link:https://github.com/eclipse/microprofile-metrics/[MicroProfile Metrics] 仕様の実装である link:https://github.com/smallrye/smallrye-metrics/[SmallRye Metrics] を使用する方法を説明しています。

source: The following https://github.com/dajudge/kindcontainer?tab=readme-ov-file#container-flavors[testcontainers] are supported: https://kind.sigs.k8s.io/[kind], https://k3s.io/[k3s] or api only(default)
ja_jp: 以下の link:https://github.com/dajudge/kindcontainer?tab=readme-ov-file#container-flavors[testcontainers] がサポートされています: link:https://kind.sigs.k8s.io/[kind] 、 link:https://k3s.io/[k3s] 、apiのみ(デフォルト)

source: The following image shows what that looks at a high level:
ja_jp: 以下のイメージでは、ハイレベルの様子を示しています。

source: The following is a simple example of how to start an LRA and how to receive a notification when the LRA is later cancelled (the `@Compensate` annotated method is called) or closed (`@Complete` is called):
ja_jp: 以下は、LRAを開始する方法と、後にLRAがキャンセルされたり（ `@Compensate` のアノテーション付きメソッドが呼び出される）、クローズされたり（ `@Complete` が呼び出される）したときに通知を受け取る方法の簡単な例です。

source: The following is an example application.properties file section illustrating the embedded realm configuration:
ja_jp: 以下は、組込レルムの設定を示すapplication.propertiesファイルのセクションの例です:

source: The following is an example for the `{config-file}` file:
ja_jp: 以下は、 `{config-file}` ファイルの例です。

source: The following is the list of platform extensions with dev services support:
ja_jp: 以下は、dev services をサポートするプラットフォームエクステンションのリストです。

source: The following key generator will be injected as a CDI bean:
ja_jp: 以下のキージェネレータはCDI Beanとして注入されます。

source: The following key generator will be instantiated using its default constructor:
ja_jp: 以下のキージェネレータは、デフォルトのコンストラクタを使用してインスタンス化されます。

source: The following links provide background on the general conventions and Asciidoc syntax.
ja_jp: 以下のリンクは、一般的な規約やAsciidocの構文に関する背景を説明しています。

source: The following method return types are supported:
ja_jp: 以下のメソッドの戻り値の型がサポートされています:

source: The following metrics can be gathered per channel, identified with the `channel` tag:
ja_jp: `channel` タグで識別されるチャネルごとに、以下のメトリクスを収集できます。

source: The following objects can be passed to recorders:
ja_jp: レコーダーに渡すことができるオブジェクトは以下の通りです。

source: The following operators are supported in `is`/`case` block conditions:
ja_jp: `is` / `case` ブロック条件では、以下の演算子がサポートされています。

source: The following parameter types are supported, in arbitrary order:
ja_jp: 以下のパラメーターの型がサポートされています（順不同）:

source: The following parameter types will be supported out of the box:
ja_jp: 次のパラメーター型は、そのままでサポートされます。

source: The following procedure outlines how you can enable Basic authentication for your application by using the `elytron-security-properties-file` extension.
ja_jp: 次の手順では、`elytron-security-properties-file` エクステンションを使用してアプリケーションの Basic 認証を有効にする方法について説明します。

source: The following procedures create a Quarkus application that consists of a single class that implements an algorithm for checking whether a number is prime. This algorithm is exposed over a REST interface. Additionally, specific annotations are required to ensure that the desired metrics are calculated over time and can be exported for manual analysis or processing by additional tooling.
ja_jp: 次の手順では、MavenベースのQuarkusアプリケーションを作成します。このアプリケーションは、数が素数であるかどうかをチェックするアルゴリズムを実装する1つのクラスで構成されています。このアルゴリズムはRESTインターフェイスで公開されます。さらに、目的のメトリクスが時間経過とともに計算され、手動分析または追加のツールによる処理のためにエクスポートできるように特定のアノテーションが必要です。

source: The following properties are available to customize the Infinispan Dev Services:
ja_jp: Infinispan Dev Servicesをカスタマイズするために、以下のプロパティが用意されています:

source: The following properties can be used to configure form based auth:
ja_jp: 以下のプロパティーを使用して、フォームベース認証を設定することができます。

source: The following properties can be used to configure form-based authentication:
ja_jp: フォームベース認証の設定には、以下のプロパティーを使用できます:

source: The following properties can be used to customize the container image build process.
ja_jp: 以下のプロパティーを使用して、コンテナーイメージのビルドプロセスをカスタマイズすることができます。

source: The following properties configuration demonstrates how you can enable PostgreSQL testing to run in production (`prod`) mode only. In this scenario, `Dev Services for PostgreSQL` launches and configures a `PostgreSQL` test container.
ja_jp: 以下のプロパティ構成は、PostgreSQLのテストを本番環境( `prod` )モードのみで実行できるようにする方法を示しています。このシナリオでは、 `Dev Services for PostgreSQL` が `PostgreSQL` テストコンテナを起動し、構成します。

source: The following section describes the Quarkus built-in authentication mechanisms for HTTP based FORM, BASIC, and Mutual TLS authentication.
ja_jp: 以下のセクションでは、HTTPベースのFORM認証、Basic認証、相互TLS認証に関するQuarkusの組込認証メカニズムについて説明します。

source: The following section describes the Quarkus built-in authentication mechanisms for HTTP based FORM, BASIC, and Mutual TLS authentication. Proactive authentication is also described.
ja_jp: このドキュメントでは、HTTPベースのFORM認証、BASIC認証、相互TLS認証、およびプロアクティブ認証のためのQuarkusのビルトイン認証メカニズムについて説明します。また、プロアクティブ認証についても説明します。

source: The following section describes the configuration for single or multiple datasources. For simplicity, we will reference a single datasource as the default (unnamed) datasource.
ja_jp: 以下のセクションでは、単一または複数のデータソースの設定について説明します。 ここでは簡単のため、単一のデータソースをデフォルトの (無名の) データソースとして参照します。

source: The following section is only for extension developers. An extension can register a certificate in the TLS registry. This is useful when an extension provides a certificate to the application or provides the certificate in a different format.
ja_jp: 次のセクションはエクステンション開発者のみを対象としています。エクステンションは、TLS レジストリーに証明書を登録できます。これは、エクステンションがアプリケーションに証明書を提供する場合や、異なる形式で証明書を提供する場合に役立ちます。

source: The following sections describe the most important supported features of Spring Data REST.
ja_jp: 以下のセクションでは、Spring Data RESTの最も重要なサポートされている機能について説明します。

source: The following sections described the most important supported features of Spring Data JPA.
ja_jp: 次のセクションでは、Spring Data JPA でサポートされている最も重要な機能について説明しています。

source: The following sections detail the specific configuration properties.
ja_jp: 以下のセクションでは、具体的な設定プロパティの詳細を説明します。

source: The following sections guide you through setting up HTTPS by using PEM or PKCS12 keystore types. In addition, they provide guidance on named configurations to specify and manage multiple TLS configurations simultaneously, allowing you to define distinct settings for each.
ja_jp: 次のセクションでは、PEM または PKCS12 キーストアタイプを使用して HTTPS を設定する方法を説明します。さらに、名前付き設定を使用して複数の TLS 設定を同時に指定および管理し、それぞれに個別の設定を定義する方法についても説明します。

source: The following sections guide you through setting up HTTPS by using PEM or PKCS12 keystore types. In addition, they provide information on how to use named configurations to specify and manage multiple TLS setups at once, which makes it possible for you to define distinct settings for each.
ja_jp: 次のセクションでは、PEM または PKCS12 キーストアタイプを使用して HTTPS を設定する方法を説明します。 さらに、名前付き設定を使用して複数の TLS 設定を一度に指定および管理する方法も説明します。この方法を使用すると、それぞれに個別の設定を定義できます。

source: The following sections outline the available TLS configuration properties.
ja_jp: 次のセクションでは、利用可能な TLS 設定プロパティーの概要を説明します。

source: The following sections outline the various properties available for configuring TLS.
ja_jp: 次のセクションでは、TLS を設定するために使用できるさまざまなプロパティーを説明します。

source: The following sections show how `AccessTokenRequestFilter` and `JsonWebTokenRequestFilter` can help.
ja_jp: 以下のセクションでは、 `AccessTokenRequestFilter` と `JsonWebTokenRequestFilter` がどのように役立つかを説明します。

source: The following semantics are supported:
ja_jp: 以下のセマンティクスがサポートされています:

source: The following snippet provides an example:
ja_jp: 次のスニペットはその例です。

source: The following snippet shows an example of the generated `.env` file:
ja_jp: 次のスニペットは、生成された `.env` ファイルの例を示しています。

source: The following snippet shows how to create a transaction executing two related _writes_:
ja_jp: 次のスニペットは、2 つの関連する _書き込み_ を実行するトランザクションを作成する方法を示しています。

source: The following snippet shows how to run 2 insertions in the same transaction:
ja_jp: 次のスニペットは、同じトランザクションで 2 つの挿入を実行する方法を示しています。

source: The following snippet shows how to set a custom password provider that represents a password that was hashed with the SHA256 hashing algorithm.
ja_jp: 次のスニペットは、SHA256 ハッシュアルゴリズムでハッシュ化されたパスワードを表すカスタムパスワードプロバイダを設定する方法を示しています。

source: The following snippet shows how to set a custom password provider that represents a password which was hashed with the SHA256 hashing algorithm.
ja_jp: 次のスニペットは、SHA256ハッシュアルゴリズムでハッシュされたパスワードを表すカスタムパスワードプロバイダを設定する方法を示しています。

source: The following snippet shows the description of the `quarkus tls` command, containing two sub-commands:
ja_jp: 次のスニペットは、2 つのサブコマンドを含む `quarkus tls` コマンドの説明を示しています。

source: The following snippet uses an example _Service_ object with an annotation for generating a TLS certificate.
ja_jp: 次のスニペットでは、TLS 証明書を生成するためのアノテーションが付いたサンプルの _Service_ オブジェクトを使用しています。

source: The following snippets give examples of YAML configurations:
ja_jp: 次のスニペットは YAML 設定の例です：

source: The following snippets provide examples of YAML configuration:
ja_jp: 次のスニペットは、YAML設定の例です。

source: The following snippets show how you can log the different types of events.
ja_jp: 次のスニペットは、さまざまな種類のイベントをログに記録する方法を示しています。

source: The following snippets shows how a _cache_ can emit a `Notification` after every `set`, and how a subscriber can receive the notification.
ja_jp: 以下のスニペットは、_キャッシュ_ が `set` ごとに `Notification` を発行する方法と、サブスクライバーがその通知を受信する方法を示しています。

source: The following table lists the **most** used libraries from the Vert.x ecosystem. To access these APIs, add the indicated extension or dependency to your project. Check the associated documentation to learn how to use them.
ja_jp: 次の表は、Vert.xエコシステムで *最も* 使用されているライブラリの一覧です。 これらのAPIにアクセスするには、指定されたエクステンションまたは依存関係をプロジェクトに追加します。 使用方法については、関連ドキュメントを参照してください。

source: The following table lists the most used libraries from the Vert.x ecosystem. To access these APIs, add the indicated extension or dependency to your project. Refer to the associated documentation to learn how to use them.
ja_jp: 次の表は、Vert.xエコシステムで最も使用されているライブラリの一覧です。これらのAPIにアクセスするには、指定されたエクステンションまたは依存関係をプロジェクトに追加します。使用方法については、関連ドキュメントを参照してください。

source: The following table lists the supported properties:
ja_jp: 次の表は、サポートされるプロパティの一覧です:

source: The following table maps specific authentication requirements to a supported mechanism that you can use in Quarkus:
ja_jp: 次の表は、特定の認証要件と、Quarkus で使用できるサポートされる認証メカニズムを対応付けたものです:

source: The following table matches the legacy REST Client dependencies with the new Reactive REST Client ones.
ja_jp: 次の表は、従来の REST Client の依存関係と、新しい Reactive REST Client の依存関係を対応付けたものです。

source: The following table matches the legacy RESTEasy Classic-based REST Client dependencies with the new REST Client ones.
ja_jp: 次の表は、従来の RESTEasy Classic ベースの REST クライアントの依存関係と新しい REST クライアントの依存関係を対応付けています。

source: The following table matches the legacy RESTEasy annotations with the new Quarkus REST ones.
ja_jp: 次の表は、従来の RESTEasy アノテーションと新しい Quarkus REST アノテーションを対応させたものです。

source: The following table matches the legacy RESTEasy annotations with the new RESTEasy Reactive ones.
ja_jp: 次の表は、従来のRESTEasyアノテーションと新しいRESTEasy Reactiveアノテーションを対応させたものです。

source: The following table matches the legacy RESTEasy dependencies with the new Quarkus REST ones.
ja_jp: 次の表は、従来の RESTEasy 依存関係と新しい Quarkus REST 依存関係を対応付けています。

source: The following table matches the legacy RESTEasy dependencies with the new RESTEasy Reactive ones.
ja_jp: 次の表は、従来のRESTEasyの依存関係と新しいRESTEasy Reactiveの依存関係を対応付けたものです。

source: The following table outlines some limitations of using HTTP Basic authentication to secure your Quarkus applications:
ja_jp: 次の表は、Quarkusアプリケーションを保護するためにHTTP Basic認証を使用する際の制限事項をまとめたものです:

source: The following table outlines the build strategies that {project-name} supports:
ja_jp: 以下の表は{project-name}がサポートするビルドストラテジーの概要です：

source: The following table provides a summary of the options for each authentication mechanism:
ja_jp: 各認証メカニズムのオプションの概要は、次の表のとおりです:

source: The following table provides an overview of the observability extensions available in Quarkus, the signals they provide and which is the recommended extension for each signal.
ja_jp: 次の表は、Quarkus で利用可能なオブザーバビリティーエクステンション、それらが提供するシグナル、および各シグナルに推奨されるエクステンションの概要を示しています。

source: The following table shows how Spring DI annotations can be converted to CDI and / or MicroProfile annotations.
ja_jp: 以下の表は、Spring DIのアノテーションをCDIおよび/またはMicroProfileのアノテーションに変換する方法を示しています。

source: The following table shows how Spring Security annotations can be converted to JAX-RS annotations.
ja_jp: 次の表は、Spring SecurityアノテーションをJAX-RSアノテーションに変換する方法を示しています。

source: The following table shows how Spring Security annotations can be converted to Jakarta REST annotations.
ja_jp: 次の表は、Spring SecurityアノテーションをJakarta RESTアノテーションに変換する方法を示しています。

source: The following table shows how Spring Web annotations can be converted to JAX-RS annotations.
ja_jp: 以下の表は、Spring WebアノテーションをJAX-RSアノテーションに変換する方法を示しています。

source: The following table shows how Spring Web annotations can be converted to Jakarta REST annotations.
ja_jp: 以下の表は、Spring WebのアノテーションをJakarta RESTのアノテーションに変換する方法を示しています。

source: The following table summarizes the new set of rules:
ja_jp: 以下の表は、新しいルールをまとめたものです。

source: The following table summarizes the options:
ja_jp: 以下の表は各選択肢の概要です。

source: The following tables list the built-in `db-kind` values, the corresponding Quarkus extensions, and the JDBC drivers used by those extensions.
ja_jp: 次の表には、組み込みの `db-kind` 値、対応する Quarkus エクステンション、およびそれらのエクステンションで使用される JDBC ドライバーが記載されています。

source: The following tables list the events that you can receive for Uni and Multi. Each of them is associated with its own group (onX). The second table lists the classic action you can do upon an event. Note that some groups offer more possibilities.
ja_jp: 以下の表は、UniとMultiで受信できるイベントの一覧です。それぞれのイベントは、独自のグループ（onX）に関連付けられています。2つ目の表は、イベントを受けてできる古典的なアクションの一覧です。グループによってはより多くの可能性があることに注意してください。

source: The following three blueprints are conceptual, infrastructure-agnostic reference architectures. Each stands on its own and shows how to structure a Java solution with Quarkus (runtime, APIs, orchestration) and LangChain4j (LLM access, embeddings, tools, chains).
ja_jp: 以下の3つのブループリントは、概念的でインフラストラクチャーに依存しないリファレンスアーキテクチャーです。それぞれが独立しており、Quarkus（ランタイム、API、オーケストレーション）とLangChain4j（LLMアクセス、埋め込み、ツール、チェーン）を使用してJavaソリューションを構築する方法を示しています。

source: The following variables externalize key information that can change over time, and so references to such information should be done by using the variable inside of {} curly brackets. The complete list of externalized variables for use is given in the following table:
ja_jp: 以下の変数は、時間の経過とともに変化する可能性のある重要な情報を外部化したもので、そのような情報への参照は、{}中括弧の中で変数を使用する必要があります。使用する外部化変数の完全なリストは、次の表に示されています：

source: The following variables externalize key information that can change over time. References to such information should use the variable inside of curly brackets, `{}`.
ja_jp: 以下の変数は、時間の経過とともに変化する重要な情報を外部化しています。このような情報を参照するには、中括弧で囲まれた `{}` 内の変数を使用する必要があります。

source: The following verification steps use the `openshift-helloworld` example application.
ja_jp: 以下の検証ステップでは、 `openshift-helloworld` サンプル・アプリケーションを使用します。

source: The following will build all modules in the Quarkus repository (except test modules) and install them in your local maven repository with the `999-SNAPSHOT` version:
ja_jp: 以下は、Quarkusリポジトリにあるすべてのモジュール（テストモジュールを除く）をビルドし、 `999-SNAPSHOT`バージョンでローカルmavenリポジトリにインストールします:

source: The following will build all modules in the Quarkus repository except docs and test modules and install them in your local maven repository with the `999-SNAPSHOT` version:
ja_jp: 以下は、Quarkusリポジトリにあるdocsとtestモジュール以外のすべてのモジュールをビルドし、 `999-SNAPSHOT`バージョンでローカルmavenリポジトリにインストールします：

source: The following xref:test-users-example[Example of `test-users.properties`] illustrates the format:
ja_jp: 次の xref:test-users-example[`test-users.properties` 例] は、そのフォーマットを示しています:

source: The form POST request will fail with HTTP status `400` if the filter finds the hidden CSRF form field is missing, the CSRF cookie is missing, or if the CSRF form field and CSRF cookie values do not match.
ja_jp: フィルタが、隠された CSRF フォームフィールドがない、CSRF クッキーがない、あるいは CSRF フォームフィールドと CSRF クッキーの値が一致しないことを発見した場合、フォーム POST リクエストは HTTP ステータス `400` で失敗します。

source: The formal parameter `library` is identified as the parameter matching same-named `LibraryPermission` constructor parameter. Therefore, Quarkus will pass the `library` parameter to the `LibraryPermission` class constructor. However, the `LibraryPermission` must be instantiated each time the `updateLibrary` method is invoked.
ja_jp: 仮パラメーター `library` は、同じ名前の `LibraryPermission` コンストラクターパラメーターと一致するパラメーターとして識別されます。 したがって、Quarkus は `library` パラメーターを `LibraryPermission` クラスコンストラクターに渡します。 ただし、 `updateLibrary` メソッドが呼び出されるたびに `LibraryPermission` をインスタンス化する必要があります。

source: The formal parameter `update` is identified as the first `Library` parameter and gets passed to the `LibraryPermission` class. However, the `LibraryPermission` must be instantiated each time the `updateLibrary` method is invoked.
ja_jp: フォーマルパラメーター `update` は最初の `Library` パラメーターとして識別され、 `LibraryPermission` クラスに渡されます。 ただし、 `updateLibrary` メソッドが呼び出されるたびに `LibraryPermission` をインスタンス化する必要があります。

source: The format for durations uses the standard `java.time.Duration` format. You can learn more about it in the link:https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc].
ja_jp: 期間のフォーマットは標準の `java.time.Duration` フォーマットを使用します。詳細は link:https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc] を参照してください。

source: The format is `fully-qualified-class-name/method-name/annotation-name/property-name=value`. You can also configure a property for all the annotation via `annotation-name/property-name=value`.
ja_jp: フォーマットは `fully-qualified-class-name/method-name/annotation-name/property-name=value` です。また、 `annotation-name/property-name=value` を通じて、すべてのアノテーションに対するプロパティを設定することもできます。

source: The format is simple: one class per line.
ja_jp: フォーマットはシンプルで、1行に1クラスです。

source: The format object returned by the `Qute.fmt(String)` method can be evaluated lazily and used e.g. as a log message:
ja_jp: `Qute.fmt(String)` メソッドが返すフォーマットオブジェクトは、遅延評価され、たとえば、ログメッセージとして使用することができます。

source: The format of the result can be controlled with one of four options:
ja_jp: 結果のフォーマットは、4つのオプションのいずれかで制御できます：

source: The four parameters provided to the playbook are pretty self-explanatory. The first one, `app_name`, is the name of the application, in our case, it's just `getting-started`. The second one, `quarkus_app_repo_url`, is the URL to the Git repository to checkout. The third one is optional, `quarkus_app_source_folder` specifies, if needed, which subfolder from the repo the source code is located. Finally, the fourth one indicates where to install the application on the target.
ja_jp: playbookに提供される4つのパラメータは、かなり自明です。最初のもの、 `app_name` はアプリケーションの名前で、私たちの場合は `getting-started` とします。2つ目の `quarkus_app_repo_url` は、チェックアウトするGitリポジトリのURLです。3番目はオプションで、 `quarkus_app_source_folder` は、必要であれば、ソースコードがリポジトリのどのサブフォルダーにあるかを指定します。最後に4つ目は、ターゲットの何処にアプリケーションをインストールするかを指定します。

source: The framework verifies that the producer/consumer chain is complete, meaning that if the application writes messages into an in-memory channel (using a method with only `@Outgoing`, or an `Emitter`), it must also consume the messages from within the application (using a method with only `@Incoming` or using an unmanaged stream).
ja_jp: フレームワークは、プロデューサー/コンシューマーチェーンが完全であることを確認します。つまり、アプリケーションがメッセージをインメモリーチャネルに書き込む場合 (`@Outgoing` のみを持つメソッド、または `Emitter` を使用)、アプリケーション内からメッセージを消費する必要もあります (`@Incoming` のみを持つメソッド、またはアンマネージドストリームを使用)。

source: The framework verifies that the producer/consumer chain is complete, meaning that if the application writes messages into an internal channel (using a method with only `@Outgoing`, or an `Emitter`), it must also consume the messages from within the application (using a method with only `@Incoming` or using an unmanaged stream).
ja_jp: フレームワークは、プロデューサー/コンシューマーチェーンが完全であることを確認します。 つまり、アプリケーションがメッセージをインターナルチャネルに書き込む場合 (`@Outgoing` のみを持つメソッド、または `Emitter` を使用)、 アプリケーション内からメッセージを消費する必要もあります (`@Incoming` のみを持つメソッド、またはアンマネージドストリームを使用)。

source: The full flavor of GraalVM to use e.g. `19.3.1-java11`. Make sure to use a `java11` version.
ja_jp: 使用する GraalVM のフルフレーバー (例: `19.3.1-java11`)。必ず`java11` のバージョンを使用してください。

source: The full list of possible filters and available mass indexer configurations is presented in the example below.
ja_jp: 使用可能なフィルターと利用可能な一括インデクサー設定の完全なリストを以下の例に示します。

source: The full list of the Kuberneters client configuration properties is provided below.
ja_jp: Kuberneters クライアント設定プロパティーの完全なリストは、以下のとおりです。

source: The full list of the Kubernetes client configuration properties is provided below.
ja_jp: Kubernetes クライアント設定プロパティーの完全なリストを以下に示します。

source: The full schema of the GraphQL API can be retrieved by calling the following:
ja_jp: GraphQL APIの完全なスキーマは、以下を呼び出すことで取得できます。

source: The full set of Quarkus-native configuration properties is detailed in the <<configuration-reference>>. The specification-defined configuration properties are still supported, but the Quarkus-native configuration takes priority.
ja_jp: Quarkus ネイティブの設定プロパティーの完全なセットについては、<<configuration-reference>> で説明されています。 仕様定義の設定プロパティーは引き続きサポートされますが、Quarkus ネイティブ設定が優先されます。

source: The full set of types supported by the Pulsar Schema autodetection is:
ja_jp: Pulsar Schema の自動検出でサポートされているすべてのタイプは、次のとおりです。

source: The full set of types supported by the serializer/deserializer autodetection is:
ja_jp: シリアライザー/デシリアライザーの自動検出でサポートされるタイプの完全なセットは以下のとおりです。

source: The full source code looks as follows:
ja_jp: ソースコードの全文は以下の通りです:

source: The full source of the `knative.json` file looks something like this:
ja_jp: `knative.json` ファイルの完全なソースはこんな感じです。

source: The full source of the `kubernetes.json` file looks something like this:
ja_jp: `kubernetes.json` ファイルの完全なソースは以下の通りです:
